balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33EP128MC504.PIC
          <edc:ModuleExclude edc:impl="0x7ff" edc:offset="0x6"/>
          <edc:ModuleExclude edc:impl="0x7ff" edc:offset="0x8"/>
          <edc:ModuleExclude edc:impl="0x7ff" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0x7ff" edc:offset="0xc"/>
          <edc:ModuleExclude edc:impl="0x7" edc:offset="0xe"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="336"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="FEXL" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="FEXL" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FEXL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="FEXL" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="FEXU" edc:desc="" edc:impl="0x0" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="FEXU" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FEXU" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="FEXU" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="VISI" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="VISI" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VISI" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="VISI" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DPCL" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DPCL" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DPCL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DPCL" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="DPCU" edc:desc="" edc:impl="0x0" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="DPCU" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DPCU" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="DPCU" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="18"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="_APPO" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="_APPO" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="_APPO" edc:desc="" edc:mask="0xffff" edc:name="_APPO" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="_APPIN" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="_APPIN" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="_APPIN" edc:desc="" edc:mask="0xffff" edc:name="_APPIN" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="APPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------xxxxx" edc:name="APPS" edc:nzwidth="16" edc:por="-----------xxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="APIFUL" edc:desc="" edc:mask="0x1" edc:name="APIFUL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="APIOV" edc:desc="" edc:mask="0x1" edc:name="APIOV" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AROFUL" edc:desc="" edc:mask="0x1" edc:name="AROFUL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="APOOV" edc:desc="" edc:mask="0x1" edc:name="APOOV" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRFUL" edc:desc="" edc:mask="0x1" edc:name="STRFUL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="STROUTL" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="STROUTL" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STROUTL" edc:desc="" edc:mask="0xffff" edc:name="STROUTL" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="STROUTH" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="STROUTH" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STROUTH" edc:desc="" edc:mask="0xffff" edc:name="STROUTH" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="STROVCNT" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="STROVCNT" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STROVCNT" edc:desc="" edc:mask="0xffff" edc:name="STROVCNT" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="26"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DFTADD" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DFTADD" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DFTADD" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DFTADD" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DFTDATA" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DFTDATA" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DFTDATA" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DFTDATA" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DFTDATA_INC" edc:desc="" edc:impl="0xffff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DFTDATA_INC" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DFTDATA_INC" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DFTDATA_INC" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="36"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="JDATAH" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="JDATAH" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="JDATAH" edc:desc="" edc:mask="0xffff" edc:name="JDATAH" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="JDATAL" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="JDATAL" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="JDATAL" edc:desc="" edc:mask="0xffff" edc:name="JDATAL" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:EmulatorSector edc:beginaddr="0xFD0000" edc:endaddr="0xfd0072" edc:regionid="emulreg"/>
      <edc:GPRDataSector edc:beginaddr="0x001000" edc:endaddr="0x005000" edc:regionid="data"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
</edc:PIC>